In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\roaming\python\python313\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
# check version 
import pandas as pd
print(pd.__version__)

2.2.3

In [3]:
# Series and a DataFrame.

data = ["Java","C++","c#","Python","Ruby","JSP"]

s = pd.Series(data)
print(s)

0      Java
1       C++
2        c#
3    Python
4      Ruby
5       JSP
dtype: object

In [4]:
indexs = [101,102,103,104,105,106]
s = pd.Series(data,index=indexs)
print(s)

101      Java
102       C++
103        c#
104    Python
105      Ruby
106       JSP
dtype: object

In [7]:
# create a DataFrame

data = {
    "name":["joy","rahul","yash","ketan","amit"],
    "age":[23,45,65,78,42],
    "salary":[23000,45000,65000,78000,42000]
}

df = pd.DataFrame(data)
print(df)

    name  age  salary
0    joy   23   23000
1  rahul   45   45000
2   yash   65   65000
3  ketan   78   78000
4   amit   42   42000

In [9]:
data = pd.read_csv("dataset/employee.csv")
print(data)

                Name     Salary          City  Age   Department Date of Join  \
0       Emily Harris   85432.45      New York   35    Marketing   14-03-2017
1       Jacob Wright   60523.12       Houston   29  Engineering   10-06-2019
2     Olivia Johnson   72345.00       Chicago   42           HR   23-09-2015
3     Ethan Thompson   38900.78       Phoenix   26      Support   05-02-2021
4       Ava Martinez  112300.00   Los Angeles   38      Finance   17-07-2013
5   William Anderson   51200.65  Philadelphia   31        Sales   30-12-2020
6       Sophia Clark   78000.30       Houston   45    Marketing   12-08-2016
7        James Lewis   44789.99       Chicago   28      Support   09-01-2022
8    Isabella Walker   91000.55      New York   37  Engineering   03-04-2018
9   Michael Robinson   69500.00       Phoenix   33           HR   15-11-2014
10   Charlotte Adams   76500.20       Chicago   34        Sales   24-05-2016
11   Benjamin Turner   83220.45       Houston   40  Engineering   02-11-2017
12   Amelia Mitchell   49000.99      New York   27           HR   18-03-2020
13       Lucas Perez  103200.75       Phoenix   44      Finance   01-12-2015
14        Mia Carter   58840.10  Philadelphia   30      Support   27-07-2021
15     Henry Ramirez   69000.50   Los Angeles   36    Marketing   06-10-2014
16     Harper Brooks   61000.00      New York   32  Engineering   10-09-2018
17     Daniel Murphy   74020.60       Chicago   41           HR   25-04-2013
18       Evelyn Bell   85800.75       Houston   39        Sales   19-08-2016
19    Matthew Cooper   44200.00       Phoenix   26      Support   14-06-2022
20      Abigail Reed   97500.95  Philadelphia   35      Finance   07-03-2015
21    Jackson Bailey   55200.89   Los Angeles   29    Marketing   30-12-2020
22    Scarlett Kelly   61800.30       Chicago   33        Sales   11-01-2019
23      Aiden Rivera   80500.22       Houston   38  Engineering   28-02-2017
24        Ella James   47000.40      New York   28           HR   05-10-2021
25      David Morgan  109000.00       Phoenix   45      Finance   22-08-2012
26        Grace Diaz   58300.75  Philadelphia   31      Support   13-04-2023
27       Joseph Hall   69500.33   Los Angeles   37    Marketing   19-01-2016
28        Chloe Ward   71200.66       Chicago   34        Sales   20-07-2018
29     Samuel Torres   82000.40       Houston   42  Engineering   17-06-2014

   Employee Code
0        EMP1000
1        EMP1001
2        EMP1002
3        EMP1003
4        EMP1004
5        EMP1005
6        EMP1006
7        EMP1007
8        EMP1008
9        EMP1009
10       EMP1100
11       EMP1101
12       EMP1102
13       EMP1103
14       EMP1104
15       EMP1105
16       EMP1106
17       EMP1107
18       EMP1108
19       EMP1109
20       EMP1110
21       EMP1111
22       EMP1112
23       EMP1113
24       EMP1114
25       EMP1115
26       EMP1116
27       EMP1117
28       EMP1118
29       EMP1119

In [10]:
print(data.head())

             Name     Salary         City  Age   Department Date of Join  \
0    Emily Harris   85432.45     New York   35    Marketing   14-03-2017
1    Jacob Wright   60523.12      Houston   29  Engineering   10-06-2019
2  Olivia Johnson   72345.00      Chicago   42           HR   23-09-2015
3  Ethan Thompson   38900.78      Phoenix   26      Support   05-02-2021
4    Ava Martinez  112300.00  Los Angeles   38      Finance   17-07-2013

  Employee Code
0       EMP1000
1       EMP1001
2       EMP1002
3       EMP1003
4       EMP1004

In [11]:
# top 3
print(data.head(3))

             Name    Salary      City  Age   Department Date of Join  \
0    Emily Harris  85432.45  New York   35    Marketing   14-03-2017
1    Jacob Wright  60523.12   Houston   29  Engineering   10-06-2019
2  Olivia Johnson  72345.00   Chicago   42           HR   23-09-2015

  Employee Code
0       EMP1000
1       EMP1001
2       EMP1002

In [12]:
# print only column
print(data.columns)

Index(['Name', 'Salary', 'City', 'Age', 'Department', 'Date of Join',
       'Employee Code'],
      dtype='object')

In [13]:
print(data.describe())

              Salary        Age
count      30.000000  30.000000
mean    71359.402667  34.833333
std     19398.163795   5.736053
min     38900.780000  26.000000
25%     58435.587500  30.250000
50%     70350.495000  34.500000
75%     82915.437500  38.750000
max    112300.000000  45.000000

In [14]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   Salary         30 non-null     float64
 2   City           30 non-null     object
 3   Age            30 non-null     int64
 4   Department     30 non-null     object
 5   Date of Join   30 non-null     object
 6   Employee Code  30 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.8+ KB
None